andredubov/STM32F407VET6-PCBTEACH/Core/Src/dma.c
#include "stm32f407xx.h"
#include "dma.h"
#include "delay.h"
#include "uart.h"
#include "critical_section.h"
#include <stddef.h>
#include <string.h>

// Максимальное количество потоков (Stream) в DMA2
#define DMA2_MAX_STREAMS      8

// Флаги прерываний для каждого потока в LIFCR/HIFCR
#define DMA2_TCIF(stream)          (1 << (6 * (stream)))
#define DMA2_HTIF(stream)          (2 << (6 * (stream)))
#define DMA2_TEIF(stream)          (4 << (6 * (stream)))

// Таймаут по умолчанию (мс)
#define DMA_TIMEOUT_MS          1000

// Статические переменные
static bool is_initialized = false;
static bool stream_initialized[DMA2_MAX_STREAMS] = {false};
static dma_callback_t complete_callback[DMA2_MAX_STREAMS] = {NULL};
static dma_callback_t half_callback[DMA2_MAX_STREAMS] = {NULL};
static dma_callback_t error_callback[DMA2_MAX_STREAMS] = {NULL};
static bool is_transfer_completed[DMA2_MAX_STREAMS] = {false};
static bool is_transfer_failed[DMA2_MAX_STREAMS] = {false};

// Таблица маппинга периферии на потоки и каналы
static const dma2_mapping_t dma_mapping_table[] = {
    [DMA2_PERIPH_SPI2_RX]    = DMA2_SPI2_RX_MAPPING,
    [DMA2_PERIPH_SPI2_TX]    = DMA2_SPI2_TX_MAPPING,
    [DMA2_PERIPH_USART1_RX]  = DMA2_USART1_RX_MAPPING,
    [DMA2_PERIPH_USART1_TX]  = DMA2_USART1_TX_MAPPING,
    [DMA2_PERIPH_USART2_RX]  = DMA2_USART2_RX_MAPPING,
    [DMA2_PERIPH_USART2_TX]  = DMA2_USART2_TX_MAPPING,
    [DMA2_PERIPH_ADC1]       = DMA2_ADC1_MAPPING,
    [DMA2_PERIPH_TIM1_CH1]   = DMA2_TIM1_CH1_MAPPING,
    [DMA2_PERIPH_TIM1_CH2]   = DMA2_TIM1_CH2_MAPPING,
    [DMA2_PERIPH_TIM1_CH3]   = DMA2_TIM1_CH3_MAPPING,
    [DMA2_PERIPH_TIM1_CH4]   = DMA2_TIM1_CH4_MAPPING,
    [DMA2_PERIPH_TIM1_UP]    = DMA2_TIM1_UP_MAPPING,
    [DMA2_PERIPH_TIM1_TRIG]  = DMA2_TIM1_TRIG_MAPPING,
    [DMA2_PERIPH_TIM1_COM]   = DMA2_TIM1_COM_MAPPING,
};

// Получение указателя на Stream по номеру
static DMA_Stream_TypeDef* get_stream(dma2_stream_t stream)
{
    if (stream >= DMA2_MAX_STREAMS) {
        return NULL;
    }
    return DMA2_Stream0 + stream;
}

// ============================================================================
// Функции для работы с маппингом
// ============================================================================

dma2_mapping_t dma_get_mapping(dma2_periph_t periph)
{
    if (periph >= 0 && periph < sizeof(dma_mapping_table) / sizeof(dma_mapping_table[0])) {
        return dma_mapping_table[periph];
    }
    
    dma2_mapping_t invalid = {DMA2_STREAM_MAX, (dma2_channel_t)8};
    return invalid;
}

dma2_stream_t dma_get_stream(dma2_periph_t periph)
{
    return dma_get_mapping(periph).stream;
}

dma2_channel_t dma_get_channel(dma2_periph_t periph)
{
    return dma_get_mapping(periph).channel;
}

// ============================================================================
// Инициализация DMA
// ============================================================================

void dma_init(void)
{
    if (is_initialized) {
        return;
    }

    // Включить тактирование DMA2
    RCC->AHB1ENR |= RCC_AHB1ENR_DMA2EN;
    
    // Сбросить все потоки
    for (uint8_t i = 0; i < DMA2_MAX_STREAMS; i++) {
        DMA_Stream_TypeDef *stream = get_stream((dma2_stream_t)i);
        
        stream->CR &= ~DMA_SxCR_EN;
        while (stream->CR & DMA_SxCR_EN) {
            __NOP();
        }
        
        stream->CR = 0;
        stream->NDTR = 0;
        stream->PAR = 0;
        stream->M0AR = 0;
        stream->M1AR = 0;
        stream->FCR = 0;
        
        stream_initialized[i] = false;
        complete_callback[i] = NULL;
        half_callback[i] = NULL;
        error_callback[i] = NULL;
    }
    
    // Сбрасываем все флаги прерываний DMA2
    DMA2->LIFCR = 0xFFFFFFFF;
    DMA2->HIFCR = 0xFFFFFFFF;
    
    // Настройка NVIC для DMA2
    NVIC_SetPriority(DMA2_Stream0_IRQn, 0x0C);
    NVIC_EnableIRQ(DMA2_Stream0_IRQn);
    
    NVIC_SetPriority(DMA2_Stream1_IRQn, 0x0C);
    NVIC_EnableIRQ(DMA2_Stream1_IRQn);
    
    NVIC_SetPriority(DMA2_Stream2_IRQn, 0x0C);
    NVIC_EnableIRQ(DMA2_Stream2_IRQn);
    
    NVIC_SetPriority(DMA2_Stream3_IRQn, 0x0C);
    NVIC_EnableIRQ(DMA2_Stream3_IRQn);
    
    NVIC_SetPriority(DMA2_Stream4_IRQn, 0x0C);
    NVIC_EnableIRQ(DMA2_Stream4_IRQn);
    
    NVIC_SetPriority(DMA2_Stream5_IRQn, 0x0C);
    NVIC_EnableIRQ(DMA2_Stream5_IRQn);
    
    NVIC_SetPriority(DMA2_Stream6_IRQn, 0x0C);
    NVIC_EnableIRQ(DMA2_Stream6_IRQn);
    
    NVIC_SetPriority(DMA2_Stream7_IRQn, 0x0C);
    NVIC_EnableIRQ(DMA2_Stream7_IRQn);
    
    is_initialized = true;
    uart_send_line("DMA2 initialized");
}

// ============================================================================
// Основные функции DMA
// ============================================================================

dma_error_t dma_set_config(dma2_stream_t stream, const dma_config_t *config)
{
    if (!config || stream >= DMA2_MAX_STREAMS) {
        return DMA_ERROR_PARAM;
    }
    
    DMA_Stream_TypeDef *dma_stream = get_stream(stream);
    if (!dma_stream) {
        return DMA_ERROR_CHANNEL;
    }
    
    if (dma_stream->CR & DMA_SxCR_EN) {
        return DMA_ERROR_BUSY;
    }
    
    uint32_t basepri = critical_enter_basp();
    uint32_t cr = 0;
    dma_stream->CR = 0;
    
    // Настройка направления передачи
    switch (config->mode) {
        case DMA_MODE_PERIPH_TO_MEM:
            cr &= ~DMA_SxCR_DIR;
            break;
        case DMA_MODE_MEM_TO_PERIPH:
            cr &= ~DMA_SxCR_DIR;
            cr |= DMA_SxCR_DIR_0;
            break;
        case DMA_MODE_MEM_TO_MEM:
            cr &= ~DMA_SxCR_DIR;
            cr |= DMA_SxCR_DIR_1;
            break;
        default:
            critical_exit_basp(basepri);
            return DMA_ERROR_PARAM;
    }
    
    // Настройка размера данных
    switch (config->data_size) {
        case DMA_DATA_SIZE_BYTE:
            cr &= ~(DMA_SxCR_MSIZE | DMA_SxCR_PSIZE);
            break;
        case DMA_DATA_SIZE_HALF_WORD:
            cr |= DMA_SxCR_PSIZE_0 | DMA_SxCR_MSIZE_0;
            break;
        case DMA_DATA_SIZE_WORD:
            cr |= DMA_SxCR_PSIZE_1 | DMA_SxCR_MSIZE_1;
            break;
        default:
            break;
    }
    
    // Настройка приоритета
    cr |= ((uint32_t)config->priority << DMA_SxCR_PL_Pos);
    
    // Циркулярный режим
    if (config->circular_mode == DMA_CIRCULAR_ENABLED && config->mode != DMA_MODE_MEM_TO_MEM) {
        cr |= DMA_SxCR_CIRC;
    }
    
