andredubov/STM32F407VET6-PCBTEACH/Core/Src/dma.c
    // Инкремент адресов
    if (config->increment.peripheral_increment) {
        cr |= DMA_SxCR_PINC;
    }
    if (config->increment.memory_increment) {
        cr |= DMA_SxCR_MINC;
    }
    
    // Для Memory-to-memory режима
    if (config->mode == DMA_MODE_MEM_TO_MEM) {
        // cr |= DMA_SxCR_DBM;
    }
    
    // Настройка прерываний
    // if (config->transfer_complete_interrupt) {
        cr |= DMA_SxCR_TCIE;
    // }
    // if (config->half_transfer_interrupt) {
        cr |= DMA_SxCR_HTIE;
    // }
    // if (config->transfer_error_interrupt) {
        cr |= DMA_SxCR_TEIE;
    // }
    
    // Настройка канала (для периферийных операций)
    if (config->mode != DMA_MODE_MEM_TO_MEM) {
        cr |= ((uint32_t)config->channel << DMA_SxCR_CHSEL_Pos);
    }

    // Настройка FIFO
    // dma_stream->FCR = DMA_SxFCR_DMDIS;
    dma_stream->CR = cr;

    critical_exit_basp(basepri);

    stream_initialized[stream] = true;

    uart_printf_line("DMA stream %d configured: mode=%d, data_size=%d, priority=%d",
        stream, 
        config->mode, 
        config->data_size, 
        config->priority
    );
    
    return DMA_OK;
}

dma_error_t dma_start(dma2_stream_t stream,
    uint32_t peripheral_addr,
    uint32_t memory_addr,
    uint32_t data_count)
{
    if (stream >= DMA2_MAX_STREAMS || !stream_initialized[stream]) {
        return DMA_ERROR_PARAM;
    }
    
    if (data_count == 0 || data_count > 0xFFFF) {
        return DMA_ERROR_PARAM;
    }

    DMA_Stream_TypeDef *dma_stream = get_stream(stream);
    if (!dma_stream) {
        return DMA_ERROR_CHANNEL;
    }

    if (dma_stream->CR & DMA_SxCR_EN) {
        return DMA_ERROR_BUSY;
    }

    uint32_t basepri = critical_enter_basp();

    dma_stream->PAR = peripheral_addr;
    dma_stream->M0AR = memory_addr;
    dma_stream->NDTR = data_count;

    // Сбрасываем флаги прерываний
    dma_clear_flags(stream);

    dma_stream->CR |= DMA_SxCR_EN;

    critical_exit_basp(basepri);

    uart_printf_line("DMA stream %d started: count=%lu, periph=0x%08lX, mem=0x%08lX",
        stream, 
        data_count, 
        peripheral_addr,
        memory_addr
    );

    return DMA_OK;
}

dma_error_t dma_stop(dma2_stream_t stream)
{
    if (stream >= DMA2_MAX_STREAMS) {
        return DMA_ERROR_PARAM;
    }
    
    DMA_Stream_TypeDef *dma_stream = get_stream(stream);
    if (!dma_stream) {
        return DMA_ERROR_CHANNEL;
    }

    uint32_t basepri = critical_enter_basp();

    dma_stream->CR &= ~DMA_SxCR_EN;

    bool timeout = false;
    uint32_t start_tick = get_tick_ms();
    while (dma_stream->CR & DMA_SxCR_EN) {
        if ((get_tick_ms() - start_tick) > DMA_TIMEOUT_MS) {
            timeout = true;
            break;
        }
    }

    critical_exit_basp(basepri);
    
    if (timeout) {
        return DMA_ERROR_TIMEOUT;
    }
    
    uart_printf_line("DMA stream %d stopped", stream);
    
    return DMA_OK;
}

bool dma_is_busy(dma2_stream_t stream)
{
    if (stream >= DMA2_MAX_STREAMS) {
        return false;
    }
    
    DMA_Stream_TypeDef *dma_stream = get_stream(stream);
    if (!dma_stream) {
        return false;
    }

    return !dma_is_stream_completed(stream) && !dma_is_stream_failed(stream);
}

bool dma_is_stream_completed(dma2_stream_t stream)
{
    if (stream >= DMA2_MAX_STREAMS) {
        return false;
    }
    
    DMA_Stream_TypeDef *dma_stream = get_stream(stream);
    if (!dma_stream) {
        return false;
    }

    bool result;

    CRITICAL_SECTION_START();
    result = is_transfer_completed[stream];
    CRITICAL_SECTION_END();

    return result;
}

bool dma_is_stream_failed(dma2_stream_t stream)
{
    if (stream >= DMA2_MAX_STREAMS) {
        return false;
    }
    
    DMA_Stream_TypeDef *dma_stream = get_stream(stream);
    if (!dma_stream) {
        return false;
    }

    bool result;

    CRITICAL_SECTION_START();
    result = is_transfer_failed[stream];
    CRITICAL_SECTION_END();

    return result;
}

uint32_t dma_get_remaining(dma2_stream_t stream)
{
    if (stream >= DMA2_MAX_STREAMS) {
        return 0;
    }
    
    DMA_Stream_TypeDef *dma_stream = get_stream(stream);
    if (!dma_stream) {
        return 0;
    }
    
    return dma_stream->NDTR;
}

void dma_clear_flags(dma2_stream_t stream)
{
    if (stream >= DMA2_MAX_STREAMS) {
        return;
    }

    is_transfer_failed[stream] = false;
    is_transfer_completed[stream] = false;
    
    if (stream < 4) {
        DMA2->LIFCR = DMA2_TCIF(stream) | DMA2_HTIF(stream) | DMA2_TEIF(stream);
    } else {
        DMA2->HIFCR = DMA2_TCIF(stream - 4) | DMA2_HTIF(stream - 4) | DMA2_TEIF(stream - 4);
    }
}

void dma_set_callback(dma2_stream_t stream, 
    dma_callback_t complete_cb, 
    dma_callback_t half_cb, 
    dma_callback_t error_cb)
{
    if (stream >= DMA2_MAX_STREAMS) {
        return;
    }
    
    uint32_t basepri = critical_enter_basp();
    
    complete_callback[stream] = complete_cb;
    half_callback[stream] = half_cb;
    error_callback[stream] = error_cb;
    
    critical_exit_basp(basepri);
}

dma_error_t dma_wait(dma2_stream_t stream, uint32_t timeout_ms)
{
    if (stream >= DMA2_MAX_STREAMS) {
        return DMA_ERROR_PARAM;
    }
    
    uint32_t start_tick = get_tick_ms();
    
    while ( dma_is_busy(stream) ) {
        if ((get_tick_ms() - start_tick) > timeout_ms) {
            dma_stop(stream);
            return DMA_ERROR_TIMEOUT;
        }
    }
    
    return DMA_OK;
}

// ============================================================================
// Специализированные функции
// ============================================================================

dma_error_t dma_memcpy(dma2_stream_t stream, void* dest, const void* src, uint32_t size_bytes)
{
    if (stream != DMA2_STREAM_0) {
        return DMA_ERROR_PARAM;  // Mem-to-Mem только на Stream 0
    }
    
    if (dest == NULL || src == NULL || size_bytes == 0) {
        return DMA_ERROR_PARAM;
    }
    
    dma_config_t config = {
        .mode = DMA_MODE_MEM_TO_MEM,
        .data_size = DMA_DATA_SIZE_BYTE,
        .priority = DMA_PRIORITY_HIGH,
        .circular_mode = DMA_CIRCULAR_DISABLED,
        .increment = {
            .peripheral_increment = true,
            .memory_increment = true
        },
        .transfer_complete_interrupt = true,
        .half_transfer_interrupt = true,
        .transfer_error_interrupt = true,
        .channel = DMA2_CHANNEL_0
    };
    
    dma_error_t error = dma_set_config(stream, &config);
    if (error != DMA_OK) {
        return error;
    }
    
    return dma_start(stream, (uint32_t)src, (uint32_t)dest, size_bytes);
}

// ============================================================================
// Удобные функции для периферии
// ============================================================================

// static dma_error_t dma_periph_init(dma2_periph_t periph, 
//     dma_mode_t mode,
//     uint32_t buffer_addr, 
//     uint32_t buffer_size,
//     bool circular, 
//     dma_priority_t priority)
// {
//     dma2_mapping_t mapping = dma_get_mapping(periph);
//     if (mapping.stream >= DMA2_MAX_STREAMS) {
//         return DMA_ERROR_PARAM;
//     }
    
