andredubov/STM32F407VET6-PCBTEACH/Core/Src/dma.c
//     dma_config_t config = {
//         .mode = mode,
//         .data_size = DMA_DATA_SIZE_BYTE,
//         .priority = priority,
//         .circular_mode = circular ? DMA_CIRCULAR_ENABLED : DMA_CIRCULAR_DISABLED,
//         .increment = {
//             .peripheral_increment = false,
//             .memory_increment = true
//         },
//         .transfer_complete_interrupt = true,
//         .half_transfer_interrupt = circular ? true : false,
//         .transfer_error_interrupt = true,
//         .channel = mapping.channel
//     };
    
//     dma_error_t error = dma_config(mapping.stream, &config);
//     if (error != DMA_OK) {
//         return error;
//     }
    
//     return DMA_OK;
// }

// SPI2
dma_error_t dma_spi2_rx_init(dma2_stream_t stream, uint32_t buffer_addr, uint32_t buffer_size)
{
    dma_config_t config = {
        .mode = DMA_MODE_PERIPH_TO_MEM,
        .data_size = DMA_DATA_SIZE_BYTE,
        .priority = DMA_PRIORITY_MEDIUM,
        .circular_mode = DMA_CIRCULAR_DISABLED,
        .increment = {
            .peripheral_increment = false,
            .memory_increment = true
        },
        .transfer_complete_interrupt = true,
        .half_transfer_interrupt = false,
        .transfer_error_interrupt = true,
        .channel = DMA2_CHANNEL_0
    };
    
    dma_error_t error = dma_set_config(stream, &config);
    if (error != DMA_OK) {
        return error;
    }
    
    return dma_start(stream, (uint32_t)&SPI2->DR, buffer_addr, buffer_size);
}

dma_error_t dma_spi2_tx_init(dma2_stream_t stream, uint32_t buffer_addr, uint32_t buffer_size)
{
    dma_config_t config = {
        .mode = DMA_MODE_MEM_TO_PERIPH,
        .data_size = DMA_DATA_SIZE_BYTE,
        .priority = DMA_PRIORITY_MEDIUM,
        .circular_mode = DMA_CIRCULAR_DISABLED,
        .increment = {
            .peripheral_increment = false,
            .memory_increment = true
        },
        .transfer_complete_interrupt = true,
        .half_transfer_interrupt = false,
        .transfer_error_interrupt = true,
        .channel = DMA2_CHANNEL_0
    };
    
    dma_error_t error = dma_set_config(stream, &config);
    if (error != DMA_OK) {
        return error;
    }
    
    return dma_start(stream, (uint32_t)&SPI2->DR, buffer_addr, buffer_size);
}

// USART1
dma_error_t dma_uart1_rx_init(dma2_stream_t stream, uint32_t buffer_addr, uint32_t buffer_size)
{
    dma_config_t config = {
        .mode = DMA_MODE_PERIPH_TO_MEM,
        .data_size = DMA_DATA_SIZE_BYTE,
        .priority = DMA_PRIORITY_MEDIUM,
        .circular_mode = DMA_CIRCULAR_ENABLED,
        .increment = {
            .peripheral_increment = false,
            .memory_increment = true
        },
        .transfer_complete_interrupt = true,
        .half_transfer_interrupt = true,
        .transfer_error_interrupt = true,
        .channel = DMA2_CHANNEL_4
    };
    
    dma_error_t error = dma_set_config(stream, &config);
    if (error != DMA_OK) {
        return error;
    }
    
    return dma_start(stream, (uint32_t)&USART1->DR, buffer_addr, buffer_size);
}

dma_error_t dma_uart1_tx_init(dma2_stream_t stream, uint32_t buffer_addr, uint32_t buffer_size)
{
    dma_config_t config = {
        .mode = DMA_MODE_MEM_TO_PERIPH,
        .data_size = DMA_DATA_SIZE_BYTE,
        .priority = DMA_PRIORITY_MEDIUM,
        .circular_mode = DMA_CIRCULAR_DISABLED,
        .increment = {
            .peripheral_increment = false,
            .memory_increment = true
        },
        .transfer_complete_interrupt = true,
        .half_transfer_interrupt = false,
        .transfer_error_interrupt = true,
        .channel = DMA2_CHANNEL_4
    };
    
    dma_error_t error = dma_set_config(stream, &config);
    if (error != DMA_OK) {
        return error;
    }
    
    return dma_start(stream, (uint32_t)&USART1->DR, buffer_addr, buffer_size);
}

// ADC1
dma_error_t dma_adc1_init(dma2_stream_t stream, uint32_t buffer_addr, uint32_t buffer_size)
{
    dma_config_t config = {
        .mode = DMA_MODE_PERIPH_TO_MEM,
        .data_size = DMA_DATA_SIZE_HALF_WORD,
        .priority = DMA_PRIORITY_HIGH,
        .circular_mode = DMA_CIRCULAR_ENABLED,
        .increment = {
            .peripheral_increment = false,
            .memory_increment = true
        },
        .transfer_complete_interrupt = true,
        .half_transfer_interrupt = true,
        .transfer_error_interrupt = true,
        .channel = DMA2_CHANNEL_0
    };
    
    dma_error_t error = dma_set_config(stream, &config);
    if (error != DMA_OK) {
        return error;
    }
    
    return dma_start(stream, (uint32_t)&ADC1->DR, buffer_addr, buffer_size);
}

// ============================================================================
// Функции с автоматическим выбором потока
// ============================================================================

dma_error_t dma_spi2_rx_init_auto(uint32_t buffer_addr, uint32_t buffer_size)
{
    return dma_spi2_rx_init(dma_get_stream(DMA2_PERIPH_SPI2_RX), buffer_addr, buffer_size);
}

dma_error_t dma_spi2_tx_init_auto(uint32_t buffer_addr, uint32_t buffer_size)
{
    return dma_spi2_tx_init(dma_get_stream(DMA2_PERIPH_SPI2_TX), buffer_addr, buffer_size);
}

dma_error_t dma_uart1_rx_init_auto(uint32_t buffer_addr, uint32_t buffer_size)
{
    return dma_uart1_rx_init(dma_get_stream(DMA2_PERIPH_USART1_RX), buffer_addr, buffer_size);
}

dma_error_t dma_uart1_tx_init_auto(uint32_t buffer_addr, uint32_t buffer_size)
{
    return dma_uart1_tx_init(dma_get_stream(DMA2_PERIPH_USART1_TX), buffer_addr, buffer_size);
}

dma_error_t dma_uart2_rx_init_auto(uint32_t buffer_addr, uint32_t buffer_size)
{
    return dma_uart1_rx_init(dma_get_stream(DMA2_PERIPH_USART2_RX), buffer_addr, buffer_size);
}

dma_error_t dma_uart2_tx_init_auto(uint32_t buffer_addr, uint32_t buffer_size)
{
    return dma_uart1_tx_init(dma_get_stream(DMA2_PERIPH_USART2_TX), buffer_addr, buffer_size);
}

dma_error_t dma_adc1_init_auto(uint32_t buffer_addr, uint32_t buffer_size)
{
    return dma_adc1_init(dma_get_stream(DMA2_PERIPH_ADC1), buffer_addr, buffer_size);
}

// ============================================================================
// Обработчики прерываний DMA2
// ============================================================================

void DMA2_Stream0_IRQHandler(void)
{
    uint32_t dma_stream_id = 0;
    uint32_t flags = DMA2->LISR;
    
    if (flags & DMA_LISR_TCIF0) {
        DMA2->LIFCR = DMA_LIFCR_CTCIF0;

        uint32_t basepri = critical_enter_basp();
        is_transfer_completed[dma_stream_id] = true;
        critical_exit_basp(basepri);

        if (complete_callback[dma_stream_id]) {
            complete_callback[dma_stream_id]();
        }
    }
    
    if (flags & DMA_LISR_HTIF0) {
        DMA2->LIFCR = DMA_LIFCR_CHTIF0;
        if (half_callback[dma_stream_id]) {
            half_callback[dma_stream_id]();
        }
    }
    
    if (flags & DMA_LISR_TEIF0) {
        DMA2->LIFCR = DMA_LIFCR_CTEIF0;

        uint32_t basepri = critical_enter_basp();
        is_transfer_failed[dma_stream_id] = true;
        critical_exit_basp(basepri);

