andredubov/STM32F407VET6-PCBTEACH/Core/Src/dma.c
        if (error_callback[dma_stream_id]) {
            error_callback[dma_stream_id]();
        }
    }
}

void DMA2_Stream1_IRQHandler(void)
{
    uint32_t dma_stream_id = 1;
    uint32_t flags = DMA2->LISR;
    
    if (flags & DMA_LISR_TCIF1) {
        DMA2->LIFCR = DMA_LIFCR_CTCIF1;
        
        uint32_t basepri = critical_enter_basp();
        is_transfer_completed[dma_stream_id] = true;
        critical_exit_basp(basepri);

        if (complete_callback[dma_stream_id]) {
            complete_callback[dma_stream_id]();
        }
    }
    
    if (flags & DMA_LISR_HTIF1) {
        DMA2->LIFCR = DMA_LIFCR_CHTIF1;
        if (half_callback[dma_stream_id]) {
            half_callback[dma_stream_id]();
        }
    }
    
    if (flags & DMA_LISR_TEIF1) {
        DMA2->LIFCR = DMA_LIFCR_CTEIF1;

        uint32_t basepri = critical_enter_basp();
        is_transfer_failed[dma_stream_id] = true;
        critical_exit_basp(basepri);

        if (error_callback[dma_stream_id]) {
            error_callback[dma_stream_id]();
        }
    }
}

void DMA2_Stream2_IRQHandler(void)
{
    uint32_t dma_stream_id = 2;
    uint32_t flags = DMA2->LISR;
    
    if (flags & DMA_LISR_TCIF2) {
        DMA2->LIFCR = DMA_LIFCR_CTCIF2;
        
        uint32_t basepri = critical_enter_basp();
        is_transfer_completed[dma_stream_id] = true;
        critical_exit_basp(basepri);

        if (complete_callback[dma_stream_id]) {
            complete_callback[dma_stream_id]();
        }
    }
    
    if (flags & DMA_LISR_HTIF2) {
        DMA2->LIFCR = DMA_LIFCR_CHTIF2;
        if (half_callback[dma_stream_id]) {
            half_callback[dma_stream_id]();
        }
    }
    
    if (flags & DMA_LISR_TEIF2) {
        DMA2->LIFCR = DMA_LIFCR_CTEIF2;
        
        uint32_t basepri = critical_enter_basp();
        is_transfer_failed[dma_stream_id] = true;
        critical_exit_basp(basepri);

        if (error_callback[dma_stream_id]) {
            error_callback[dma_stream_id]();
        }
    }
}

void DMA2_Stream3_IRQHandler(void)
{
    uint32_t dma_stream_id = 3;
    uint32_t flags = DMA2->LISR; 

    if (flags & DMA_LISR_TCIF3) {
        DMA2->LIFCR = DMA_LIFCR_CTCIF3;

        uint32_t basepri = critical_enter_basp();
        is_transfer_completed[dma_stream_id] = true;
        critical_exit_basp(basepri);

        if (complete_callback[dma_stream_id]) {
            complete_callback[dma_stream_id]();
        }
    }
    
    if (flags & DMA_LISR_HTIF3) {
        DMA2->LIFCR = DMA_LIFCR_CHTIF3;
        if (half_callback[dma_stream_id]) {
            half_callback[dma_stream_id]();
        }
    }
    
    if (flags & DMA_LISR_TEIF3) {
        DMA2->LIFCR = DMA_LIFCR_CTEIF3;
        
        uint32_t basepri = critical_enter_basp();
        is_transfer_failed[dma_stream_id] = true;
        critical_exit_basp(basepri);

        if (error_callback[dma_stream_id]) {
            error_callback[dma_stream_id]();
        }
    }
}

void DMA2_Stream4_IRQHandler(void)
{
    uint32_t dma_stream_id = 4;
    uint32_t flags = DMA2->HISR;
    
    if (flags & DMA_HISR_TCIF4) {
        DMA2->HIFCR = DMA_HIFCR_CTCIF4;
        
        uint32_t basepri = critical_enter_basp();
        is_transfer_completed[4] = true;
        critical_exit_basp(basepri);

        if (complete_callback[dma_stream_id]) {
            complete_callback[dma_stream_id]();
        }
    }
    
    if (flags & DMA_HIFCR_CHTIF4) {
        DMA2->HIFCR = DMA_HIFCR_CHTIF4;
        if (half_callback[dma_stream_id]) {
            half_callback[dma_stream_id]();
        }
    }
    
    if (flags & DMA_HIFCR_CTEIF4) {
        DMA2->HIFCR = DMA_HIFCR_CTEIF4;
        
        uint32_t basepri = critical_enter_basp();
        is_transfer_failed[dma_stream_id] = true;
        critical_exit_basp(basepri);

        if (error_callback[dma_stream_id]) {
            error_callback[dma_stream_id]();
        }
    }
}

void DMA2_Stream5_IRQHandler(void)
{
    uint32_t dma_stream_id = 5;
    uint32_t flags = DMA2->HISR;
    
    if (flags & DMA_HISR_TCIF5) {
        DMA2->HIFCR = DMA_HIFCR_CTCIF5;
        
        uint32_t basepri = critical_enter_basp();
        is_transfer_completed[dma_stream_id] = true;
        critical_exit_basp(basepri);

        if (complete_callback[dma_stream_id]) {
            complete_callback[dma_stream_id]();
        }
    }
    
    if (flags & DMA_HIFCR_CHTIF5) {
        DMA2->HIFCR = DMA_HIFCR_CHTIF5;
        if (half_callback[dma_stream_id]) {
            half_callback[dma_stream_id]();
        }
    }
    
    if (flags & DMA_HIFCR_CTEIF5) {
        DMA2->HIFCR = DMA_HIFCR_CTEIF5;
        
        uint32_t basepri = critical_enter_basp();
        is_transfer_failed[dma_stream_id] = true;
        critical_exit_basp(basepri);

        if (error_callback[dma_stream_id]) {
            error_callback[dma_stream_id]();
        }
    }
}

void DMA2_Stream6_IRQHandler(void)
{
    uint32_t dma_stream_id = 6;
    uint32_t flags = DMA2->HISR;
    
    if (flags & DMA_HISR_TCIF6) {
        DMA2->HIFCR = DMA_HIFCR_CTCIF6;

        uint32_t basepri = critical_enter_basp();
        is_transfer_completed[6] = true;
        critical_exit_basp(basepri);

        if (complete_callback[dma_stream_id]) {
            complete_callback[dma_stream_id]();
        }
    }

    if (flags & DMA_HIFCR_CHTIF6) {
        DMA2->HIFCR = DMA_HIFCR_CHTIF6;
        if (half_callback[dma_stream_id]) {
            half_callback[dma_stream_id]();
        }
    }

    if (flags & DMA_HIFCR_CTEIF6) {
        DMA2->HIFCR = DMA_HIFCR_CTEIF6;
        
        uint32_t basepri = critical_enter_basp();
        is_transfer_failed[dma_stream_id] = true;
        critical_exit_basp(basepri);

        if (error_callback[dma_stream_id]) {
            error_callback[dma_stream_id]();
        }
    }
}

void DMA2_Stream7_IRQHandler(void)
{
    uint32_t dma_stream_id = 7;
    uint32_t flags = DMA2->HISR;
    
    if (flags & DMA_HISR_TCIF7) {
        DMA2->HIFCR = DMA_HIFCR_CTCIF7;

        uint32_t basepri = critical_enter_basp();
        is_transfer_completed[dma_stream_id] = true;
        critical_exit_basp(basepri);

        if (complete_callback[dma_stream_id]) {
            complete_callback[dma_stream_id]();
        }
    }
    
    if (flags & DMA_HIFCR_CHTIF7) {
        DMA2->HIFCR = DMA_HIFCR_CHTIF7;
        if (half_callback[dma_stream_id]) {
            half_callback[dma_stream_id]();
        }
    }
    
    if (flags & DMA_HIFCR_CTEIF7) {
        DMA2->HIFCR = DMA_HIFCR_CTEIF7;
        
        uint32_t basepri = critical_enter_basp();
        is_transfer_failed[dma_stream_id] = true;
        critical_exit_basp(basepri);

        if (error_callback[dma_stream_id]) {
            error_callback[dma_stream_id]();
        }
    }
}